app/controllers/users_controller.rb

  def create
    GenerateRandomUserJob.perform_later
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("name", "phone", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "tetet"], ["phone", "53535"], ["created_at", "2021-07-16 11:50:31.790808"], ["updated_at", "2021-07-16 11:50:31.790808"]]